app/controllers/urls_controller.rb

  def index
    @urls = Url.where(:user_id => current_user.id)
---
SELECT "urls".* FROM "urls" WHERE "urls"."user_id" = 1 LIMIT 1

  def create
    logger.info "----------------------------"
    logger.info "user_id: #{current_user.id}"
    logger.info "----------------------------"
    @url = Url.new( { :long => params[:url][:long], :short => short_url(params), :visits => 0, :user => current_user } )
    respond_to do |format|
      if @url.save
---
INSERT INTO "urls" ("created_at", "long", "short", "updated_at", "user_id", "visits") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 14 Nov 2012 01:33:40 UTC +00:00], ["long", "https://github.com"], ["short", "gh"], ["updated_at", Wed, 14 Nov 2012 01:33:40 UTC +00:00], ["user_id", 1], ["visits", 0]]

  def show
    @url = Url.find(params[:id])
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "3"]]

  def edit
    @url = Url.find(params[:id])
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "7"]]

  def update
    @url = Url.find(params[:id])
    respond_to do |format|
      if @url.update_attributes( params[:url] )
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "urls" SET "long" = NULL, "short" = NULL, "updated_at" = '2012-11-12 07:16:48.874989' WHERE "urls"."id" = 8

  def destroy
    @url = Url.find(params[:id])
    @url.destroy
---
SELECT "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "urls" WHERE "urls"."id" = ?  [["id", 1]]

  def visit
#   @url = Url.find_by_short(params[:short])
    @url = Url.where(:short => params[:short]).first
    unless @url.nil?
      @url.update_attributes(:visits => (@url.visits + 1))
---
SELECT "urls".* FROM "urls" WHERE "urls"."short" = 'QMU' LIMIT 1
UPDATE "urls" SET "visits" = 2, "updated_at" = '2012-11-13 03:26:39.092679' WHERE "urls"."id" = 1