app/controllers/urls_controller.rb

  def index
    @urls = Url.all
---
SELECT "urls".* FROM "urls"