app/controllers/users_controller.rb

  def create
    @user = User.new( { :name => params[:user][:name], :email => params[:user][:email] } )
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 13 Nov 2012 04:42:27 UTC +00:00], ["email", "amiramke@gmail.com"], ["name", "Ami Kehaty"], ["updated_at", Tue, 13 Nov 2012 04:42:27 UTC +00:00]]